In [1]:
# from google.colab import drive

In [2]:
# drive.mount('/content/drive')

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
import configparser

In [3]:
config = configparser.RawConfigParser()

In [4]:
confirmerd = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Confirmed.csv')

In [5]:
confirmerd.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/13/20,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20,3/21/20,3/22/20
0,NaN,Thailand,15.0000,101.0000,2,3,5,7,8,8,...,75,82,114,147,177,212,272,322,411,599
1,NaN,Japan,36.0000,138.0000,2,1,2,2,4,4,...,701,773,839,825,878,889,924,963,1007,1086
2,NaN,Singapore,1.2833,103.8333,0,1,3,3,4,5,...,200,212,226,243,266,313,345,385,432,455
3,NaN,Nepal,28.1667,84.2500,0,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,2
4,NaN,Malaysia,2.5000,112.5000,0,0,0,3,4,4,...,197,238,428,566,673,790,900,1030,1183,1306

In [6]:
recovered = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Recovered.csv')

In [7]:
recovered.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/13/20,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20,3/21/20,3/22/20
0,NaN,Thailand,15.0000,101.0000,0,0,0,0,2,2,...,35,35,35,35,41,42,42,42,42,44
1,NaN,Japan,36.0000,138.0000,0,0,0,0,1,1,...,118,118,118,144,144,144,150,191,232,235
2,NaN,Singapore,1.2833,103.8333,0,0,0,0,0,0,...,97,105,105,109,114,114,114,124,140,144
3,NaN,Nepal,28.1667,84.2500,0,0,0,0,0,0,...,1,1,1,1,1,1,1,1,1,1
4,NaN,Malaysia,2.5000,112.5000,0,0,0,0,0,0,...,26,35,42,42,49,60,75,87,114,139

In [8]:
deaths = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_19-covid-Deaths.csv')

In [9]:
deaths.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/13/20,3/14/20,3/15/20,3/16/20,3/17/20,3/18/20,3/19/20,3/20/20,3/21/20,3/22/20
0,NaN,Thailand,15.0000,101.0000,0,0,0,0,0,0,...,1,1,1,1,1,1,1,1,1,1
1,NaN,Japan,36.0000,138.0000,0,0,0,0,0,0,...,19,22,22,27,29,29,29,33,35,40
2,NaN,Singapore,1.2833,103.8333,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,2,2
3,NaN,Nepal,28.1667,84.2500,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,NaN,Malaysia,2.5000,112.5000,0,0,0,0,0,0,...,0,0,0,0,2,2,2,3,4,10

In [10]:
confirmerd_df = confirmerd.melt(id_vars=['Province/State','Country/Region','Lat','Long'])

In [11]:
confirmerd_df.head()

  Province/State Country/Region      Lat      Long variable  value
0            NaN       Thailand  15.0000  101.0000  1/22/20      2
1            NaN          Japan  36.0000  138.0000  1/22/20      2
2            NaN      Singapore   1.2833  103.8333  1/22/20      0
3            NaN          Nepal  28.1667   84.2500  1/22/20      0
4            NaN       Malaysia   2.5000  112.5000  1/22/20      0

In [12]:
confirmerd_df = confirmerd_df.rename({'variable':'Date','value':'Confirmed'}, axis='columns')

In [13]:
confirmerd_df.head()

  Province/State Country/Region      Lat      Long     Date  Confirmed
0            NaN       Thailand  15.0000  101.0000  1/22/20          2
1            NaN          Japan  36.0000  138.0000  1/22/20          2
2            NaN      Singapore   1.2833  103.8333  1/22/20          0
3            NaN          Nepal  28.1667   84.2500  1/22/20          0
4            NaN       Malaysia   2.5000  112.5000  1/22/20          0

In [14]:
recovered_df = recovered.melt(id_vars=['Province/State','Country/Region','Lat','Long'])

In [15]:
recovered_df.head()

  Province/State Country/Region      Lat      Long variable  value
0            NaN       Thailand  15.0000  101.0000  1/22/20      0
1            NaN          Japan  36.0000  138.0000  1/22/20      0
2            NaN      Singapore   1.2833  103.8333  1/22/20      0
3            NaN          Nepal  28.1667   84.2500  1/22/20      0
4            NaN       Malaysia   2.5000  112.5000  1/22/20      0

In [16]:
recovered_df = recovered_df.rename({'variable':'Date','value':'Recovered'}, axis='columns')

In [17]:
recovered_df.head()

  Province/State Country/Region      Lat      Long     Date  Recovered
0            NaN       Thailand  15.0000  101.0000  1/22/20          0
1            NaN          Japan  36.0000  138.0000  1/22/20          0
2            NaN      Singapore   1.2833  103.8333  1/22/20          0
3            NaN          Nepal  28.1667   84.2500  1/22/20          0
4            NaN       Malaysia   2.5000  112.5000  1/22/20          0

In [18]:
deaths_df = deaths.melt(id_vars=['Province/State','Country/Region','Lat','Long'])

In [19]:
deaths_df.head()

  Province/State Country/Region      Lat      Long variable  value
0            NaN       Thailand  15.0000  101.0000  1/22/20      0
1            NaN          Japan  36.0000  138.0000  1/22/20      0
2            NaN      Singapore   1.2833  103.8333  1/22/20      0
3            NaN          Nepal  28.1667   84.2500  1/22/20      0
4            NaN       Malaysia   2.5000  112.5000  1/22/20      0

In [20]:
deaths_df = deaths_df.rename({'variable':'Date','value':'Deaths'}, axis='columns')

In [21]:
deaths_df.head()

  Province/State Country/Region      Lat      Long     Date  Deaths
0            NaN       Thailand  15.0000  101.0000  1/22/20       0
1            NaN          Japan  36.0000  138.0000  1/22/20       0
2            NaN      Singapore   1.2833  103.8333  1/22/20       0
3            NaN          Nepal  28.1667   84.2500  1/22/20       0
4            NaN       Malaysia   2.5000  112.5000  1/22/20       0

In [22]:
combined_df = [confirmerd_df, recovered_df, deaths_df]
combined_df = [df.set_index(['Province/State',	'Country/Region',	'Lat',	'Long',	'Date']) for df in combined_df]
combined_df = combined_df[0].join(combined_df[1:])

In [23]:
combined_df.head()

                                                        Confirmed  Recovered  \
Province/State Country/Region Lat     Long     Date
NaN            Thailand       15.0000 101.0000 1/22/20          2          0
               Japan          36.0000 138.0000 1/22/20          2          0
               Singapore      1.2833  103.8333 1/22/20          0          0
               Nepal          28.1667 84.2500  1/22/20          0          0
               Malaysia       2.5000  112.5000 1/22/20          0          0

                                                        Deaths
Province/State Country/Region Lat     Long     Date
NaN            Thailand       15.0000 101.0000 1/22/20       0
               Japan          36.0000 138.0000 1/22/20       0
               Singapore      1.2833  103.8333 1/22/20       0
               Nepal          28.1667 84.2500  1/22/20       0
               Malaysia       2.5000  112.5000 1/22/20       0

In [24]:
combined_df= combined_df.reset_index()

In [25]:
combined_df[['Lat',	'Long',	'Confirmed',	'Recovered',	'Deaths']]= combined_df[['Lat',	'Long',	'Confirmed',	'Recovered',	'Deaths']].apply(pd.to_numeric)

In [26]:
combined_df.Date= combined_df.Date.apply(pd.to_datetime)

In [27]:
combined_df.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Recovered,Deaths
0,NaN,Thailand,15.0000,101.0000,2020-01-22,2,0,0
1,NaN,Japan,36.0000,138.0000,2020-01-22,2,0,0
2,NaN,Singapore,1.2833,103.8333,2020-01-22,0,0,0
3,NaN,Nepal,28.1667,84.2500,2020-01-22,0,0,0
4,NaN,Malaysia,2.5000,112.5000,2020-01-22,0,0,0

In [28]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29707 entries, 0 to 29706
Data columns (total 8 columns):
Province/State    19825 non-null object
Country/Region    29707 non-null object
Lat               29707 non-null float64
Long              29707 non-null float64
Date              29707 non-null datetime64[ns]
Confirmed         29707 non-null int64
Recovered         29707 non-null int64
Deaths            29707 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(3), object(2)
memory usage: 1.8+ MB

In [29]:
combined_df.isna().sum()

Province/State    9882
Country/Region       0
Lat                  0
Long                 0
Date                 0
Confirmed            0
Recovered            0
Deaths               0
dtype: int64

In [30]:
combined_df= combined_df.rename({'Province/State': 'State','Country/Region':'Country'}, axis = 1)

In [31]:
combined_df.head()

  State    Country      Lat      Long       Date  Confirmed  Recovered  Deaths
0   NaN   Thailand  15.0000  101.0000 2020-01-22          2          0       0
1   NaN      Japan  36.0000  138.0000 2020-01-22          2          0       0
2   NaN  Singapore   1.2833  103.8333 2020-01-22          0          0       0
3   NaN      Nepal  28.1667   84.2500 2020-01-22          0          0       0
4   NaN   Malaysia   2.5000  112.5000 2020-01-22          0          0       0

In [32]:
# combined_df.set_index('Country').filter(like='India', axis = 0)

In [33]:
combined_df[combined_df['State'].isnull()]['Country'].value_counts()

Ukraine            61
Chile              61
Cape Verde         61
Liechtenstein      61
Eritrea            61
                   ..
Uzbekistan         61
Fiji               61
Finland            61
North Macedonia    61
Kosovo             61
Name: Country, Length: 162, dtype: int64

# # ! pip install -U googlemaps Using reverse geocoding

In [34]:
# import googlemaps

In [35]:
# gmaps = googlemaps.Client(key=config.get('twitter','googleapikey'))
# geocode_result = gmaps.reverse_geocode((-23.4425, -58.4438))
# print(geocode_result[0])
# print(geocode_result[0]['formatted address'])
# print(geocode_result[0]['formatted address'].split(',')[-2].strip(' '))

In [36]:
capital_df = pd.read_csv("https://raw.githubusercontent.com/icyrockcom/country-capitals/master/data/country-list.csv")

In [37]:
capital_df.head()

                 country              capital            type
0               Abkhazia              Sukhumi  countryCapital
1            Afghanistan                Kabul  countryCapital
2  Akrotiri and Dhekelia  Episkopi Cantonment  countryCapital
3                Albania               Tirana  countryCapital
4                Algeria              Algiers  countryCapital

In [38]:
capital_df['country'].replace({'United Kingdom; England':'United Kingdom'}, inplace=True)

In [39]:
capital_df[capital_df['country']=='United Kingdom']

            country capital            type
233  United Kingdom  London  countryCapital

In [40]:
capital_df['country']= capital_df['country'].str.lower()

In [41]:
capital_df= capital_df.set_index('country')

In [42]:
capital_df.loc['afghanistan'][0]

'Kabul'

In [43]:
def lookup_capital(country):
    try:
        capital = capital_df.loc[country.lower()][0]
    except:
        capital = 'TBF'
    return capital

In [44]:
combined_df_int = combined_df.copy()

In [45]:
combined_df_int['State'].isna().sum()

9882

In [46]:
# combined_df_int.apply(lambda x: lookup_capital(x['Country']), axis = 1)

In [47]:
combined_df_int['State_cleaned'] = combined_df_int.apply(lambda x: lookup_capital(x['Country']), axis = 1)

In [48]:
combined_df_int.head()

,State,Country,Lat,Long,Date,Confirmed,Recovered,Deaths,State_cleaned
0,NaN,Thailand,15.0000,101.0000,2020-01-22,2,0,0,Bangkok
1,NaN,Japan,36.0000,138.0000,2020-01-22,2,0,0,Tokyo
2,NaN,Singapore,1.2833,103.8333,2020-01-22,0,0,0,Singapore
3,NaN,Nepal,28.1667,84.2500,2020-01-22,0,0,0,Kathmandu
4,NaN,Malaysia,2.5000,112.5000,2020-01-22,0,0,0,Kuala Lumpur

In [49]:
combined_df_int[combined_df_int.State_cleaned=='TBF']['Country'].value_counts()

US                     15067
Cruise Ship               61
Bolivia                   61
Bahamas, The              61
Korea, South              61
Congo (Kinshasa)          61
Holy See                  61
Czechia                   61
Gambia, The               61
Timor-Leste               61
Martinique                61
Cabo Verde                61
Eswatini                  61
East Timor                61
Taiwan*                   61
Congo (Brazzaville)       61
North Macedonia           61
Cote d'Ivoire             61
Name: Country, dtype: int64

In [50]:
combined_df_int[combined_df_int['State'].notna()]['State'].count()

19825

In [51]:
combined_df_int['State_cleaned'] = combined_df_int.apply(lambda x: x['State'] if (np.all(pd.notnull(x['State']))) else x['State_cleaned'], axis =1 )

In [52]:
combined_df_int[combined_df_int['State_cleaned']== 'TBF']['Country'].value_counts()

Cabo Verde             61
Cote d'Ivoire          61
Congo (Brazzaville)    61
Bahamas, The           61
Taiwan*                61
Czechia                61
Korea, South           61
Bolivia                61
Martinique             61
Timor-Leste            61
East Timor             61
Gambia, The            61
Holy See               61
Congo (Kinshasa)       61
Eswatini               61
North Macedonia        61
Name: Country, dtype: int64

In [53]:
combined_df_int['Country'].replace({'Congo (Kinshasa)':'Democratic Republic of the Congo','East Timor':'East Timor (Timor-Leste)' , 'Cabo Verde':'Cape Verde','Korea, South':'South Korea','North Macedonia':'Macedonia','Congo (Brazzaville)':'Republic of the Congo','Bahamas, The':'Bahamas', 'Gambia, The':'Gambia', 'Cote d\'Ivoire':'CÃ´te d\'Ivoire','Taiwan*':'Republic of China (Taiwan)'}, inplace=True)

In [54]:
combined_df_int['State_cleaned'] = combined_df_int.apply(lambda x: lookup_capital(x['Country']), axis = 1)
combined_df_int['State_cleaned'] = combined_df_int.apply(lambda x: x['State'] if (np.all(pd.notnull(x['State']))) else x['State_cleaned'], axis =1 )

In [55]:
combined_df_int[combined_df_int['State_cleaned']== 'TBF']['Country'].value_counts()

Czechia        61
Bolivia        61
Martinique     61
Timor-Leste    61
Holy See       61
Eswatini       61
Name: Country, dtype: int64

In [56]:
combined_df_int['State_cleaned'] = combined_df_int.apply(lambda x: x['Country'] if x['State_cleaned']=='TBF' else x['State_cleaned'], axis =1)

In [57]:
# Still the United states States are no cleaned so, we will clean a bit more
combined_df_int[combined_df_int['Country']=='US']

,State,Country,Lat,Long,Date,Confirmed,Recovered,Deaths,State_cleaned
98,Washington,US,47.4009,-121.4905,2020-01-22,0,0,0,Washington
99,New York,US,42.1657,-74.9481,2020-01-22,0,0,0,New York
100,California,US,36.1162,-119.6816,2020-01-22,0,0,0,California
101,Massachusetts,US,42.2302,-71.5301,2020-01-22,0,0,0,Massachusetts
102,Diamond Princess,US,35.4437,139.6380,2020-01-22,0,0,0,Diamond Princess
...,...,...,...,...,...,...,...,...,...
29619,"New Castle, DE",US,39.5393,-75.6674,2020-03-22,0,0,0,"New Castle, DE"
29634,Alabama,US,32.3182,-86.9023,2020-03-22,138,0,0,Alabama
29637,Puerto Rico,US,18.2208,-66.5901,2020-03-22,23,0,1,Puerto Rico
29651,Guam,US,13.4443,144.7937,2020-03-22,27,0,1,Guam
29668,Virgin Islands,US,18.3358,-64.8963,2020-03-22,3,0,0,Virgin Islands

In [58]:
# Look at another github dataset of US states
us_states = pd.read_csv('https://raw.githubusercontent.com/jasonong/List-of-US-States/master/states.csv')
us_states.head()

        State Abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [59]:
combined_df_int[combined_df_int['Country']=='US']['State_cleaned']

98             Washington
99               New York
100            California
101         Massachusetts
102      Diamond Princess
               ...
29619      New Castle, DE
29634             Alabama
29637         Puerto Rico
29651                Guam
29668      Virgin Islands
Name: State_cleaned, Length: 15067, dtype: object

In [60]:
us_states = us_states.set_index('Abbreviation')

In [61]:
us_states.head()
us_states.loc['DE'][0]

'Delaware'

In [62]:
combined_df_int['City']=combined_df_int.apply(lambda x: x['State_cleaned'].split(',')[0] if x['Country'] == 'US' else '', axis =1)

In [63]:
combined_df_int[combined_df_int.Country=='US']

,State,Country,Lat,Long,Date,Confirmed,Recovered,Deaths,State_cleaned,City
98,Washington,US,47.4009,-121.4905,2020-01-22,0,0,0,Washington,Washington
99,New York,US,42.1657,-74.9481,2020-01-22,0,0,0,New York,New York
100,California,US,36.1162,-119.6816,2020-01-22,0,0,0,California,California
101,Massachusetts,US,42.2302,-71.5301,2020-01-22,0,0,0,Massachusetts,Massachusetts
102,Diamond Princess,US,35.4437,139.6380,2020-01-22,0,0,0,Diamond Princess,Diamond Princess
...,...,...,...,...,...,...,...,...,...,...
29619,"New Castle, DE",US,39.5393,-75.6674,2020-03-22,0,0,0,"New Castle, DE",New Castle
29634,Alabama,US,32.3182,-86.9023,2020-03-22,138,0,0,Alabama,Alabama
29637,Puerto Rico,US,18.2208,-66.5901,2020-03-22,23,0,1,Puerto Rico,Puerto Rico
29651,Guam,US,13.4443,144.7937,2020-03-22,27,0,1,Guam,Guam
29668,Virgin Islands,US,18.3358,-64.8963,2020-03-22,3,0,0,Virgin Islands,Virgin Islands

In [64]:
def convert_state(state):
    try:
        output = state.split(',')[1].strip()
        output = us_states.loc[output.upper()][0]
    except:
        output = state
    return output

In [65]:
combined_df_int['State_cleaned']=combined_df_int.apply(lambda x: convert_state(x['State_cleaned']) if x['Country']=='US' else x['State_cleaned'], axis =1)

In [66]:
combined_df_int  =combined_df_int.drop(['State', 'Lat', 'Long',], axis =1)

In [67]:
combined_df_int.to_csv('john_hopkins_corona_dataset.csv', index =False)

In [68]:
df = pd.read_csv('john_hopkins_corona_dataset.csv')

In [71]:
df[df['Country'] =='India'].groupby('Country').max()

               Date  Confirmed  Recovered  Deaths State_cleaned  City
Country
India    2020-03-22        396         27       7     New Delhi   NaN

In [70]:
df[df['Country'] =='Italy'].groupby('Country').max()

               Date  Confirmed  Recovered  Deaths State_cleaned  City
Country
Italy    2020-03-22      59138       7024    5476          Rome   NaN

In [72]:
df[df['Country'] =='China'].groupby('Country').max()

               Date  Confirmed  Recovered  Deaths State_cleaned  City
Country
China    2020-03-22      67800      59433    3144      Zhejiang   NaN